In [293]:
import numpy as np
import pandas as pd

In [294]:
df = pd.read_csv('imdb_movies.csv')

In [295]:
df.head(3)

,names,date_x,score,genre,overview,crew,orig_title,status,orig_lang,budget_x,revenue,country
0,Creed III,03/02/2023,73.0,"Drama, Action","After dominating the boxing world, Adonis Cree...","Michael B. Jordan, Adonis Creed, Tessa Thompso...",Creed III,Released,English,75000000.0,2.716167e+08,AU
1,Avatar: The Way of Water,12/15/2022,78.0,"Science Fiction, Adventure, Action",Set more than a decade after the events of the...,"Sam Worthington, Jake Sully, Zoe Saldaña, Neyt...",Avatar: The Way of Water,Released,English,460000000.0,2.316795e+09,AU
2,The Super Mario Bros. Movie,04/05/2023,76.0,"Animation, Adventure, Family, Fantasy, Comedy","While working underground to fix a water main,...","Chris Pratt, Mario (voice), Anya Taylor-Joy, P...",The Super Mario Bros. Movie,Released,English,100000000.0,7.244590e+08,AU

In [296]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10178 entries, 0 to 10177
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   names       10178 non-null  object
 1   date_x      10178 non-null  object
 2   score       10178 non-null  float64
 3   genre       10093 non-null  object
 4   overview    10178 non-null  object
 5   crew        10122 non-null  object
 6   orig_title  10178 non-null  object
 7   status      10178 non-null  object
 8   orig_lang   10178 non-null  object
 9   budget_x    10178 non-null  float64
 10  revenue     10178 non-null  float64
 11  country     10178 non-null  object
dtypes: float64(3), object(9)
memory usage: 954.3+ KB

In [297]:
df.shape

(10178, 12)

In [298]:
df.isna().sum()

names          0
date_x         0
score          0
genre         85
overview       0
crew          56
orig_title     0
status         0
orig_lang      0
budget_x       0
revenue        0
country        0
dtype: int64

In [299]:
df.duplicated().sum()

np.int64(0)

In [300]:
df['orig_title'].value_counts()

orig_title
Pinocchio                     12
King Kong                      9
Halloween                      9
The Ten Commandments           6
Alice in Wonderland            6
                              ..
The Lost King                  1
 黃飛鴻'92之龍行天下                   1
Honey, We Shrunk Ourselves     1
Miss Violence                  1
Avatar: The Way of Water       1
Name: count, Length: 9736, dtype: int64

In [301]:
df[df['orig_title'] == 'King Kong'].head(1)
#['country'].value_counts()

,names,date_x,score,genre,overview,crew,orig_title,status,orig_lang,budget_x,revenue,country
1914,King Kong,12/14/2005,69.0,"Adventure, Drama, Action","In 1933 New York, an overly ambitious movie pr...","Naomi Watts, Ann Darrow, Jack Black, Carl Denh...",King Kong,Released,English,207000000.0,550517357.0,AU

In [302]:
df['orig_lang'].value_counts().head(3)

orig_lang
English               7417
Japanese               714
Spanish, Castilian     397
Name: count, dtype: int64

In [303]:
print(df.duplicated(subset=['orig_title']).sum())

442

In [304]:
movie = df.drop_duplicates(subset=['orig_title'])
movie = movie.copy()

In [305]:
movie['orig_title'].value_counts().head(2)

orig_title
Creed III                   1
Avatar: The Way of Water    1
Name: count, dtype: int64

In [306]:
movie.head(2)

,names,date_x,score,genre,overview,crew,orig_title,status,orig_lang,budget_x,revenue,country
0,Creed III,03/02/2023,73.0,"Drama, Action","After dominating the boxing world, Adonis Cree...","Michael B. Jordan, Adonis Creed, Tessa Thompso...",Creed III,Released,English,75000000.0,2.716167e+08,AU
1,Avatar: The Way of Water,12/15/2022,78.0,"Science Fiction, Adventure, Action",Set more than a decade after the events of the...,"Sam Worthington, Jake Sully, Zoe Saldaña, Neyt...",Avatar: The Way of Water,Released,English,460000000.0,2.316795e+09,AU

In [307]:
int(movie['date_x'][0][6:])

2023

In [308]:
movie['year'] = movie['date_x'].apply(lambda s: int(s[6:]))

In [316]:
#movie['desc']  = f"{movie['orig_title']}  {movie['overview']}  {movie['genre']}  {movie['crew']}"

movie['desc']  = movie['names'] + movie['overview'] + movie['genre']  + movie['crew']
movie['desc'] = movie['desc'].fillna('')

movie['desc'] = movie['desc'].apply(lambda x : " ".join(x.split()))

movie['desc'] = movie['desc'].str.lower()

In [317]:
movie.head(2)

,names,date_x,score,genre,overview,crew,orig_title,status,orig_lang,budget_x,revenue,country,year,desc
0,Creed III,03/02/2023,73.0,"Drama, Action","After dominating the boxing world, Adonis Cree...","Michael B. Jordan, Adonis Creed, Tessa Thompso...",Creed III,Released,English,75000000.0,2.716167e+08,AU,2023,"creed iiiafter dominating the boxing world, ad..."
1,Avatar: The Way of Water,12/15/2022,78.0,"Science Fiction, Adventure, Action",Set more than a decade after the events of the...,"Sam Worthington, Jake Sully, Zoe Saldaña, Neyt...",Avatar: The Way of Water,Released,English,460000000.0,2.316795e+09,AU,2022,avatar: the way of waterset more than a decade...

In [318]:
movie['year'].value_counts().head(10)

year
2022    947
2021    613
2018    454
2019    447
2020    439
2017    418
2023    398
2016    375
2015    335
2014    328
Name: count, dtype: int64

In [319]:
movie =movie[movie['year'].between(2014,2022)]

In [320]:
movie.shape

(4356, 14)

In [321]:
movie.isna().sum()

names          0
date_x         0
score          0
genre         21
overview       0
crew          32
orig_title     0
status         0
orig_lang      0
budget_x       0
revenue        0
country        0
year           0
desc           0
dtype: int64

In [342]:
movie = movie.dropna()
movie = movie.reset_index()

In [343]:
columns = ['names','year','desc','genre']

In [344]:
movie = movie[columns].copy()
movie.to_csv('movie.csv')

In [345]:
from sklearn.feature_extraction.text import CountVectorizer

cv = CountVectorizer(max_features=3000,stop_words='english')

In [346]:
vector = cv.fit_transform(movie['desc']).toarray()

In [347]:
vector[0]

array([0, 0, 0, ..., 0, 0, 0], shape=(3000,))

In [348]:
cv.get_feature_names_out()

array(['000', '10', '11', ..., 'zombie', 'zombies', 'óscar'],
      shape=(3000,), dtype=object)

In [349]:
from sklearn.metrics.pairwise import cosine_similarity

In [350]:
vector.shape

(4307, 3000)

In [351]:
similar_movies = cosine_similarity(vector)

In [352]:
similar_movies.shape

(4307, 4307)

In [353]:
similar_movies[0]

array([1.        , 0.04424221, 0.02823912, ..., 0.01433848, 0.        ,
       0.01898658], shape=(4307,))

In [354]:
movie.head(3)

,names,year,desc,genre
0,Avatar: The Way of Water,2022,avatar: the way of waterset more than a decade...,"Science Fiction, Adventure, Action"
1,Puss in Boots: The Last Wish,2022,puss in boots: the last wishpuss in boots disc...,"Animation, Family, Fantasy, Adventure, Comedy"
2,Attack on Titan,2022,attack on titanas viable water is depleted on ...,"Action, Science Fiction"

In [355]:
movie_name = movie['names'].value_counts().index.str.strip().to_list()
movie_name[5]

'Prey'

In [356]:
movie_index = int(movie[movie['names'] == 'Prey'].index[0])

In [357]:
similarity_scores = list(enumerate(similar_movies[movie_index]))

similarity_scores = sorted(similarity_scores, key=lambda x: x[1], reverse=True)

similarity_scores = [(i, float(score)) for i, score in similarity_scores]

top_n = similarity_scores[1:6]

In [358]:
for i in top_n:
    #print(i[0])
    print('Movie id ->' , i[0] , 'Movie Name ->', movie.iloc[i[0]]['names'])

Movie id -> 2036 Movie Name -> Grudge
Movie id -> 3678 Movie Name -> Alien Warfare
Movie id -> 2619 Movie Name -> Alien Outpost
Movie id -> 2453 Movie Name -> The Awakener
Movie id -> 3341 Movie Name -> In the Blood

In [488]:
from urllib.parse import quote
import requests, re
from bs4 import BeautifulSoup

def wiki_poster(movie):

    title = movie.replace(" ", "_")
    title = quote(title)
    url = f"https://en.wikipedia.org/wiki/{title}"

    
    headers = {"User-Agent": "Mozilla/5.0"}
    html = requests.get(url, headers=headers).text


    soup = BeautifulSoup(html, "html.parser")

    infobox = soup.find("table", {"class": "infobox"})

    img = infobox.find("img") if infobox else None
    no_image = "https://upload.wikimedia.org/wikipedia/commons/1/14/No_Image_Available.jpg"

    return "https:" + img["src"] if img else no_image

In [489]:
index = 4230
name = movie_name[index]
year = movie[movie['names']==name]['year']
#name, year
year = int(year.values[0])

In [490]:
print(name ,year)

Gangnam Daughter-in-law 2019

In [491]:
movie[movie['names'] == 'Troll']

,names,year,desc,genre
22,Troll,2022,"trolldeep inside the mountain of dovre, someth...","Fantasy, Action, Adventure, Thriller"

In [493]:
wiki_poster('Troll')

'https://upload.wikimedia.org/wikipedia/commons/1/14/No_Image_Available.jpg'

In [494]:
def recommandation_movie(movie_name,k):

    movie_index = int(movie[movie['names'] == movie_name].index[0])
    
    similarity_scores = list(enumerate(similar_movies[movie_index]))

    similarity_scores = sorted(similarity_scores, key=lambda x: x[1], reverse=True)

    similarity_scores = [(i, float(score)) for i, score in similarity_scores]

    top_n = similarity_scores[1:k+1] 

    recommendations = [movie.iloc[i[0]]['names'] for i in top_n]
    genre = [movie.iloc[i[0]]['genre'] for i in top_n]
    
    poster = [[wiki_poster(i),i] for i in recommendations]

    #df = pd.DataFrame({'recommandation_movie':recommendations , 'genre':genre , 'poster':poster } )
    return poster

In [498]:
index = 0
movie_name[index]
recommandation_movie(name,4)

[['https://upload.wikimedia.org/wikipedia/commons/1/14/No_Image_Available.jpg',
  "My Student's Mom"],
 ['https://upload.wikimedia.org/wikipedia/commons/1/14/No_Image_Available.jpg',
  "18 Year Old Seungha's Easy Piece of Cake"],
 ['https://upload.wikimedia.org/wikipedia/commons/1/14/No_Image_Available.jpg',
  "Mom's Friend 2020"],
 ['https://upload.wikimedia.org/wikipedia/commons/1/14/No_Image_Available.jpg',
  'Young Sister-In-Law 2']]

In [428]:
## Model save
import joblib

save_ml = joblib.dump(similar_movies,'similar_movies.pkl')

## Gradio App

In [429]:
import gradio as gr

In [430]:
theme = gr.themes.Glass(
    primary_hue="red",
    neutral_hue="indigo"
).set(
    body_background_fill_dark="#000000", 
    body_text_color_dark="#e5e7eb"        
)

In [431]:
with gr.Blocks(theme=theme, title="Movie Recommender") as demo:
    gr.Markdown("## Movie Recommender")
    inp = gr.Dropdown(movie_name, label="Pick a movie",value=movie_name[0] if movie_name else None)
    k = gr.Slider(1, 5, value=5, label="Number of recommendations")
    btn = gr.Button("Recommend")
    #out = gr.List(label="Recommended Movies")
    #out = gr.Dataframe(headers=["Movie",'genres'], label="Recommended Movies")
    
    #gallery = gr.Gallery(label="Poster")
    gallery = gr.Gallery(label="Posters", show_label=True,rows=2, columns=3, height="auto", object_fit="contain")

    btn.click(recommandation_movie, inputs=[inp, k], outputs=[gallery])

demo.launch()

* Running on local URL:  http://127.0.0.1:7879
* To create a public link, set `share=True` in `launch()`.